# SQL

## Описание проекта

*Заказчик*: компания, купившая крупный сервис для чтения книг по подписке.

*Задача аналитика*: проанализировать базу данных сервиса.

*Цель исследования*: сформулировать ценностное предложение для нового продукта.

## Описание данных

Таблица books (данные о книгах):

- `book_id` — идентификатор книги;
- `author_id` — идентификатор автора;
- `title` — название книги;
- `num_pages` — количество страниц;
- `publication_date` — дата публикации книги;
- `publisher_id` — идентификатор издателя.

Таблица authors (данные об авторах):

- `author_id` — идентификатор автора;
- `author` — имя автора.

Таблица publishers (данные об издательствах):

- `publisher_id` — идентификатор издательства;
- `publisher` — название издательства;

Таблица ratings (данные о пользовательских оценках книг):

- `rating_id` — идентификатор оценки;
- `book_id` — идентификатор книги;
- `username` — имя пользователя, оставившего оценку;
- `rating` — оценка книги.

Таблица reviews (данные о пользовательских обзорах книг):

- `review_id` — идентификатор обзора;
- `book_id` — идентификатор книги;
- `username` — имя пользователя, написавшего обзор;
- `text` — текст обзора.

## План работы

- исследовать таблицы (вывод первых строк)
- решить задания по SQL
- описать выводы по каждому заданию

## Подключение к базе

In [1]:
# импортируем библиотеки
import pandas as pd
from sqlalchemy import create_engine
# устанавливаем параметры
db_config = {'user': 'praktikum_student', # имя пользователя
'pwd': 'Sdf4$2;d-d30pp', # пароль
'host': 'rc1b-wcoijxj3yxfsf3fs.mdb.yandexcloud.net',
'port': 6432, # порт подключения
'db': 'data-analyst-final-project-db'} # название базы данных
connection_string = 'postgresql://{}:{}@{}:{}/{}'.format(db_config['user'],
db_config['pwd'],
db_config['host'],
db_config['port'],
db_config['db'])
# сохраняем коннектор
engine = create_engine(connection_string, connect_args={'sslmode':'require'})

## Исследование таблиц

In [2]:
for table in ['books', 'authors', 'publishers', 'ratings', 'reviews']:
    query = ''' SELECT * FROM {}
    LIMIT 10;
    '''.format(table) 

    request = pd.io.sql.read_sql(query, con = engine) 
    print(f'Таблица - "{table}"')
    display(request)
    print(request.info())
    print('------------------------------------------------------------')

Таблица - "books"

,book_id,author_id,title,num_pages,publication_date,publisher_id
0,1,546,'Salem's Lot,594,2005-11-01,93
1,2,465,1 000 Places to See Before You Die,992,2003-05-22,336
2,3,407,13 Little Blue Envelopes (Little Blue Envelope...,322,2010-12-21,135
3,4,82,1491: New Revelations of the Americas Before C...,541,2006-10-10,309
4,5,125,1776,386,2006-07-04,268
5,6,257,1st to Die (Women's Murder Club #1),424,2005-05-20,116
6,7,258,2nd Chance (Women's Murder Club #2),400,2005-05-20,116
7,8,260,4th of July (Women's Murder Club #4),448,2006-06-01,318
8,9,563,A Beautiful Mind,461,2002-02-04,104
9,10,445,A Bend in the Road,341,2005-04-01,116

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   book_id           10 non-null     int64
 1   author_id         10 non-null     int64
 2   title             10 non-null     object
 3   num_pages         10 non-null     int64
 4   publication_date  10 non-null     object
 5   publisher_id      10 non-null     int64
dtypes: int64(4), object(2)
memory usage: 608.0+ bytes
None
------------------------------------------------------------
Таблица - "authors"

   author_id                                author
0          1                            A.S. Byatt
1          2        Aesop/Laura Harris/Laura Gibbs
2          3                       Agatha Christie
3          4                         Alan Brennert
4          5              Alan Moore/David   Lloyd
5          6                            Alan Paton
6          7           Albert Camus/Justin O'Brien
7          8                         Aldous Huxley
8          9    Aldous Huxley/Christopher Hitchens
9         10  Aleksandr Solzhenitsyn/H.T. Willetts

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   author_id  10 non-null     int64
 1   author     10 non-null     object
dtypes: int64(1), object(1)
memory usage: 288.0+ bytes
None
------------------------------------------------------------
Таблица - "publishers"

   publisher_id                                publisher
0             1                                      Ace
1             2                                 Ace Book
2             3                                Ace Books
3             4                            Ace Hardcover
4             5        Addison Wesley Publishing Company
5             6                                  Aladdin
6             7                       Aladdin Paperbacks
7             8                             Albin Michel
8             9                          Alfred A. Knopf
9            10  Alfred A. Knopf Books for Young Readers

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   publisher_id  10 non-null     int64
 1   publisher     10 non-null     object
dtypes: int64(1), object(1)
memory usage: 288.0+ bytes
None
------------------------------------------------------------
Таблица - "ratings"

   rating_id  book_id       username  rating
0          1        1     ryanfranco       4
1          2        1  grantpatricia       2
2          3        1   brandtandrea       5
3          4        2       lorichen       3
4          5        2    mariokeller       2
5          6        3  johnsonamanda       4
6          7        3    scotttamara       5
7          8        3    lesliegibbs       5
8          9        4    abbottjames       5
9         10        4   valenciaanne       4

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   rating_id  10 non-null     int64
 1   book_id    10 non-null     int64
 2   username   10 non-null     object
 3   rating     10 non-null     int64
dtypes: int64(3), object(1)
memory usage: 448.0+ bytes
None
------------------------------------------------------------
Таблица - "reviews"

,review_id,book_id,username,text
0,1,1,brandtandrea,Mention society tell send professor analysis. ...
1,2,1,ryanfranco,Foot glass pretty audience hit themselves. Amo...
2,3,2,lorichen,Listen treat keep worry. Miss husband tax but ...
3,4,3,johnsonamanda,Finally month interesting blue could nature cu...
4,5,3,scotttamara,Nation purpose heavy give wait song will. List...
5,6,3,lesliegibbs,Analysis no several cause international.
6,7,4,valenciaanne,One there cost another. Say type save. With pe...
7,8,4,abbottjames,Within enough mother. There at system full rec...
8,9,5,npowers,Thank now focus realize economy focus fly. Ite...
9,10,5,staylor,Game push lot reduce where remember. Including...

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   review_id  10 non-null     int64
 1   book_id    10 non-null     int64
 2   username   10 non-null     object
 3   text       10 non-null     object
dtypes: int64(2), object(2)
memory usage: 448.0+ bytes
None
------------------------------------------------------------

Пропусков в данных нет, типы соответствуют, кроме колонки publication_date в таблице books. Заменим на datetime64:

In [3]:
query_books = ''' SELECT * FROM books; ''' 
books = pd.io.sql.read_sql(query_books, con = engine)
books['publication_date'] = pd.to_datetime(books['publication_date'], format='%Y.%m.%dT%H:%M:%S')
books.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   book_id           1000 non-null   int64
 1   author_id         1000 non-null   int64
 2   title             1000 non-null   object
 3   num_pages         1000 non-null   int64
 4   publication_date  1000 non-null   datetime64[ns]
 5   publisher_id      1000 non-null   int64
dtypes: datetime64[ns](1), int64(4), object(1)
memory usage: 47.0+ KB

**Задание 1.**

Посчитайте, сколько книг вышло после 1 января 2000 года.

In [4]:
query = ''' 
SELECT COUNT(*) 
FROM books
WHERE publication_date > '2000-1-1'; 
''' 
request = pd.io.sql.read_sql(query, con = engine)

print(f'После 1 января 2000 года вышло {request.iloc[0,0]} книг')

После 1 января 2000 года вышло 819 книг

Почти все книги в сервисе вышли за последние 20 лет. Сервис может заинтересовать любителей современной литературы.

**Задание 2**

Для каждой книги посчитайте количество обзоров и среднюю оценку.

In [5]:
query = ''' 
SELECT 
    books.title AS title,
    books.book_id AS id,
    SubRev.n_rev AS reviews,
    SubRat.avg_rat AS avg_rating
FROM books LEFT JOIN 
                (SELECT
                    book_id,
                    AVG(rating) AS avg_rat
                FROM
                    ratings
                GROUP BY 
                    book_id
                ) AS SubRat ON SubRat.book_id = books.book_id
        LEFT JOIN
                (SELECT 
                    book_id,
                    COUNT(review_id) AS n_rev
                FROM
                    reviews
                GROUP BY 
                    book_id
                ) AS SubRev ON SubRev.book_id = books.book_id; 
''' 
request = pd.io.sql.read_sql(query, con = engine)
request

,title,id,reviews,avg_rating
0,The Body in the Library (Miss Marple #3),652,2.0,4.500000
1,Galápagos,273,2.0,4.500000
2,A Tree Grows in Brooklyn,51,5.0,4.250000
3,Undaunted Courage: The Pioneering First Missio...,951,2.0,4.000000
4,The Prophet,839,4.0,4.285714
...,...,...,...,...
995,Alice in Wonderland,64,4.0,4.230769
996,A Woman of Substance (Emma Harte Saga #1),55,2.0,5.000000
997,Christine,148,3.0,3.428571
998,The Magicians' Guild (Black Magician Trilogy #1),790,2.0,3.500000
999,The Plot Against America,828,2.0,3.000000

Посчитали количество обзоров и среднюю оценку.

**Задание 3**

Определите издательство, которое выпустило наибольшее число книг толще 50 страниц — так вы исключите из анализа брошюры.

In [7]:
query ='''
SELECT
    books.publisher_id,
    publishers.publisher,
    COUNT(books.book_id) AS n_books
FROM 
    books
INNER JOIN publishers ON books.publisher_id = publishers.publisher_id
WHERE
    books.num_pages > 50
GROUP BY
    books.publisher_id,
    publishers.publisher
ORDER BY
    n_books DESC
LIMIT 1;
'''
request = pd.io.sql.read_sql(query, con = engine)
request

   publisher_id      publisher  n_books
0           212  Penguin Books       42

Издательство, которое выпустило наибольшее число книг толще 50 страниц - Penguin Books.

**Задание 4**

Определите автора с самой высокой средней оценкой книг — учитывайте только книги с 50 и более оценками.

In [8]:
query = ''' 
SELECT 
    aut_avg.author,
    AVG(aut_avg.avg_rating) AS avg_avg_rating
FROM
        (SELECT 
            authors.author AS author
           , AVG(ratings.rating) AS avg_rating
        FROM books
            LEFT JOIN authors ON books.author_id = authors.author_id
            LEFT JOIN ratings ON books.book_id = ratings.book_id
        GROUP BY 
             books.book_id
             , authors.author_id
        HAVING
            COUNT(ratings.rating_id) >=50 
        ) AS aut_avg 
GROUP BY    
    aut_avg.author
ORDER BY
    avg_avg_rating DESC
LIMIT 1; 
''' 
request = pd.io.sql.read_sql(query, con = engine)
request

                       author  avg_avg_rating
0  J.K. Rowling/Mary GrandPré        4.283844

Автор с самой высокой средней оценкой книг - Джоан Роулинг. Заслуженная оценка!

**Задание 5**

Посчитайте среднее количество обзоров от пользователей, которые поставили больше 50 оценок.

In [10]:
query = ''' 
SELECT
    ROUND(COUNT(review_id) / COUNT(DISTINCT username) :: decimal,1) AS result
FROM
    reviews
WHERE 
    username IN 
    (SELECT 
         username
    FROM 
        ratings
    GROUP BY 
        username
    HAVING COUNT(rating_id) > 50);      
''' 
request = pd.io.sql.read_sql(query, con = engine)
request

   result
0    24.3

Cреднее количество обзоров от пользователей, которые поставили больше 50 оценок - 24,3.

**Выводы**

Почти все книги в сервисе были опубликованы начиная с 2000 года. Больше всего книг толще 50 страниц выпущены издательством Penguin Books. Cамую высокую оценку книг получила популярная писательница Дж.К.Роулинг. Активные пользователи в среднем делают 24 обзора на книги.